Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::v1::RoutingSegmentDefault Class Reference
MEP Element Manager
The RoutingSegmentDefault contains the necessary non-geometric data for creating and modifying a Routing Segment. More...
#include <MEPRoutingSegmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingSegmentDefault:
 Public Member Functions
RigidSegmentDefault  | GetRigidSegmentDefault () const
double  | GetCrossSectionWidth () const
double  | GetCrossSectionHeight () const
ConnectorShape  | GetCrossSectionShape () const
Result< uint32_t >  | GetCrossSectionReferenceId () const
Domain  | GetDomain () const
UniqueID  | GetPreferenceTableId () const
API_AnchorID  | GetAnchor () const
double  | GetReferenceLineOffsetX () const
double  | GetReferenceLineOffsetY () const
double  | GetWallThickness () const
ConnectionStyle  | GetConnectionStyle () const
std::optional< double >  | GetFlangeSize () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | SetRigidSegmentDefault (const RigidSegmentDefault &rigidSegmentDefault) const
Sets the RigidSegment to the RoutingSegmentDefault.
Result< void >  | SetCrossSectionWidth (double width)
Sets the width of the RoutingSegmentDefault.
Result< void >  | SetCrossSectionHeight (double height)
Sets the width of the RoutingSegmentDefault.
Result< void >  | SetCrossSectionShape (ConnectorShape shape)
Sets the shape of the RoutingSegmentDefault.
Result< void >  | SetCrossSectionReferenceId (uint32_t referenceId)
Sets the referenceId of Circular Cross Section in the RoutingSegmentDefault.
Result< void >  | SetPreferenceTableId (const UniqueID &uniqueId)
Sets the PreferenceTable of the RoutingSegmentDefault.
void  | SetAnchor (API_AnchorID anchor)
Sets the anchor position of the RoutingSegmentDefault.
void  | SetReferenceLineOffsetX (double offset)
Sets the offset from the reference line along the X-axis of cross-section's plane.
void  | SetReferenceLineOffsetY (double offset)
Sets the offset from the reference line along the Y-axis of cross-section's plane.
Result< void >  | SetWallThickness (double thickness)
Sets the wall thickness of the RoutingSegmentDefault.
Result< void >  | SetConnectionStyle (ConnectionStyle connectionStyle)
Sets the connection style of the RoutingSegmentDefault.
Result< void >  | SetFlangeSize (double flangeSize)
Sets the flange size (width for Ventilation, diameter for Piping) of the RoutingSegment if its connection style is Flanged.
 Public Member Functions inherited from ACAPI::v1::ElementDefault
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
RoutingSegmentDefault (std::shared_ptr< Impl::IRoutingSegmentDefaultImpl > impl)
Constructs a RoutingSegmentDefault with the given implementation.
 Protected Member Functions inherited from ACAPI::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Static Protected Member Functions
static Result< RoutingSegmentDefault >  | Create (const API_Token &token, Domain domain)
Creates a RoutingSegmentDefault with the given token and domain.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< RoutingSegmentDefault >  | CreateRoutingSegmentDefault (Domain)
Creates a RoutingSegmentDefault.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingSegmentDefault contains the necessary non-geometric data for creating and modifying a Routing Segment.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault RoutingSegmentDefault Modification
 // PickUp RoutingElementDefault from RoutingElement
 RoutingElementDefault routingElementDefault = routingElement.PickUpDefault ();
 // Get RoutingSegmentDefault of RoutingElementDefault and modify it
 RoutingSegmentDefault routingSegmentDefault = routingElementDefault.GetRoutingSegmentDefault ();
 double currentWidth = routingSegmentDefault.GetCrossSectionWidth ();
 double currentHeight = routingSegmentDefault.GetCrossSectionHeight ();
 ACAPI::Result<void> segmentDefaultModifyResult = routingSegmentDefault.Modify ([&](RoutingSegmentDefault::Modifier& modifier) {
 if (routingSegmentDefault.GetCrossSectionShape () == ConnectorShape::Circular) {
 modifier.SetCrossSectionReferenceId (63);
 } else {
 modifier.SetCrossSectionWidth (2.0 * currentWidth);
 modifier.SetCrossSectionHeight (2.0 * currentHeight);
 }
 modifier.SetAnchor (APIAnc_RB); // right bottom
 modifier.SetReferenceLineOffsetX (-0.1);
 modifier.SetReferenceLineOffsetY (0.2);
 });
 if (segmentDefaultModifyResult.IsErr ())
 return segmentDefaultModifyResult.UnwrapErr ().kind;
 // Set RoutingSegmentDefault back to RoutingElementDefault
 ACAPI::Result<void> elementDefaultModifyResult = routingElementDefault.Modify ([&](RoutingElementDefault::Modifier& modifier) {
 modifier.SetRoutingSegmentDefault (routingSegmentDefault);
 });
 if (elementDefaultModifyResult.IsErr ())
 return elementDefaultModifyResult.UnwrapErr ().kind;
 // Inject RoutingElementDefault into RoutingElement
 ACAPI::Result<void> injectResult = routingElement.Modify ([&routingElementDefault](RoutingElement::Modifier& modifier) {
 modifier.Inject (routingElementDefault);
 }, "Inject Default into RoutingElement.");
 if (injectResult.IsErr ())
 return injectResult.UnwrapErr ().kind;
 return NoError;
Constructor & Destructor Documentation
◆ RoutingSegmentDefault()
 ACAPI::MEP::v1::RoutingSegmentDefault::RoutingSegmentDefault  |  ( |  std::shared_ptr< Impl::IRoutingSegmentDefaultImpl >  |  impl | )
protected
Constructs a RoutingSegmentDefault with the given implementation.
Parameters
impl | The given implementation.
Member Function Documentation
◆ Create()
 static Result< RoutingSegmentDefault > ACAPI::MEP::v1::RoutingSegmentDefault::Create  |  ( |  const API_Token &  |  token,
|  Domain  |  domain
)
staticprotected
Creates a RoutingSegmentDefault with the given token and domain.
Parameters
token | The given token.
domain | The given domain.
Returns
The result of the creation with the created RoutingSegmentDefault.
◆ GetAnchor()
 API_AnchorID ACAPI::MEP::v1::RoutingSegmentDefault::GetAnchor  |  ( |   | ) |   const
Returns
Returns the anchor position of the RoutingSegmentDefault.
◆ GetConnectionStyle()
 ConnectionStyle ACAPI::MEP::v1::RoutingSegmentDefault::GetConnectionStyle  |  ( |   | ) |   const
Returns
Returns the connection style used by the RigidSegmentDefault's Ports.
◆ GetCrossSectionHeight()
 double ACAPI::MEP::v1::RoutingSegmentDefault::GetCrossSectionHeight  |  ( |   | ) |   const
Returns
Returns the height of the RoutingSegmentDefault.
◆ GetCrossSectionReferenceId()
 Result< uint32_t > ACAPI::MEP::v1::RoutingSegmentDefault::GetCrossSectionReferenceId  |  ( |   | ) |   const
Returns
Returns error if the Cross Section shape is Rectangular, otherwise the referenceId of the Circular Cross Section in the RoutingSegmentDefault.
◆ GetCrossSectionShape()
 ConnectorShape ACAPI::MEP::v1::RoutingSegmentDefault::GetCrossSectionShape  |  ( |   | ) |   const
Returns
Returns the shape of the RoutingSegmentDefault.
◆ GetCrossSectionWidth()
 double ACAPI::MEP::v1::RoutingSegmentDefault::GetCrossSectionWidth  |  ( |   | ) |   const
Returns
Returns the width of the RoutingSegmentDefault.
◆ GetDomain()
 Domain ACAPI::MEP::v1::RoutingSegmentDefault::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the default.
◆ GetFlangeSize()
 std::optional< double > ACAPI::MEP::v1::RoutingSegmentDefault::GetFlangeSize  |  ( |   | ) |   const
Returns
Returns the size of the flange (width for Ventilation, diameter for Piping) if the connection style is Flanged.
◆ GetPreferenceTableId()
 UniqueID ACAPI::MEP::v1::RoutingSegmentDefault::GetPreferenceTableId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable is associated with.
◆ GetReferenceLineOffsetX()
 double ACAPI::MEP::v1::RoutingSegmentDefault::GetReferenceLineOffsetX  |  ( |   | ) |   const
Returns
Returns the offset from the reference line along the X-axis of cross-section's plane
◆ GetReferenceLineOffsetY()
 double ACAPI::MEP::v1::RoutingSegmentDefault::GetReferenceLineOffsetY  |  ( |   | ) |   const
Returns
Returns the offset from the reference line along the Y-axis of cross-section's plane
◆ GetRigidSegmentDefault()
 RigidSegmentDefault ACAPI::MEP::v1::RoutingSegmentDefault::GetRigidSegmentDefault  |  ( |   | ) |   const
Returns
Returns the RigidSegmentDefault of the RoutingSegmentDefault.
◆ GetWallThickness()
 double ACAPI::MEP::v1::RoutingSegmentDefault::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the RoutingSegmentDefault. The RigidSegmentDefault's Port will use this value as well.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetAnchor()
 void ACAPI::MEP::v1::RoutingSegmentDefault::SetAnchor  |  ( |  API_AnchorID  |  anchor | )
Sets the anchor position of the RoutingSegmentDefault.
Parameters
anchor | The value to be set.
◆ SetConnectionStyle()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetConnectionStyle  |  ( |  ConnectionStyle  |  connectionStyle | )
Sets the connection style of the RoutingSegmentDefault.
Parameters
connectionStyle | The value to be set.
Returns
Returns an error if the RoutingSegmentDefault's domain does not support the provided connection style, otherwise nothing.
◆ SetCrossSectionHeight()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetCrossSectionHeight  |  ( |  double  |  height | )
Sets the width of the RoutingSegmentDefault.
Parameters
height | The value to be set.
Returns
Returns error if the Cross Section Shape is Circular, otherwise nothing.
◆ SetCrossSectionReferenceId()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetCrossSectionReferenceId  |  ( |  uint32_t  |  referenceId | )
Sets the referenceId of Circular Cross Section in the RoutingSegmentDefault.
Parameters
referenceId | The referenceId of the row from the Segment PreferenceTable. Only the valid row's ReferenceId can be set.
Returns
Returns an error if the Cross Section Shape is not Circular or the referenceId is not a valid row of the actual preferenceTable, otherwise nothing.
◆ SetCrossSectionShape()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetCrossSectionShape  |  ( |  ConnectorShape  |  shape | )
Sets the shape of the RoutingSegmentDefault.
Parameters
shape | The value to be set.
Returns
Returns error if the shape is not supported by the RoutingSegment, otherwise nothing.
◆ SetCrossSectionWidth()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetCrossSectionWidth  |  ( |  double  |  width | )
Sets the width of the RoutingSegmentDefault.
Parameters
width | The value to be set.
Returns
Returns error if the Cross Section Shape is Circular, otherwise nothing.
◆ SetFlangeSize()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetFlangeSize  |  ( |  double  |  flangeSize | )
Sets the flange size (width for Ventilation, diameter for Piping) of the RoutingSegment if its connection style is Flanged.
Parameters
flangeSize | The value to be set.
Returns
Returns an error if the RoutingSegment's connection style is not Flanged, otherwise nothing.
◆ SetPreferenceTableId()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetPreferenceTableId  |  ( |  const UniqueID &  |  uniqueId | )
Sets the PreferenceTable of the RoutingSegmentDefault.
Parameters
uniqueId | The UniqueID of the PreferenceTable.
Returns
Returns an error if the parameter does not identify a PreferenceTable, otherwise nothing.
◆ SetReferenceLineOffsetX()
 void ACAPI::MEP::v1::RoutingSegmentDefault::SetReferenceLineOffsetX  |  ( |  double  |  offset | )
Sets the offset from the reference line along the X-axis of cross-section's plane.
Parameters
offset | The value to be set.
◆ SetReferenceLineOffsetY()
 void ACAPI::MEP::v1::RoutingSegmentDefault::SetReferenceLineOffsetY  |  ( |  double  |  offset | )
Sets the offset from the reference line along the Y-axis of cross-section's plane.
Parameters
offset | The value to be set.
◆ SetRigidSegmentDefault()
 void ACAPI::MEP::v1::RoutingSegmentDefault::SetRigidSegmentDefault  |  ( |  const RigidSegmentDefault &  |  rigidSegmentDefault | ) |   const
Sets the RigidSegment to the RoutingSegmentDefault.
Parameters
rigidSegmentDefault | The value to be set.
◆ SetWallThickness()
 Result< void > ACAPI::MEP::v1::RoutingSegmentDefault::SetWallThickness  |  ( |  double  |  thickness | )
Sets the wall thickness of the RoutingSegmentDefault.
Parameters
thickness | The value to be set.
Returns
Returns an error if the RoutingSegmentDefault's wall thickness is controlled by its PreferenceTable, otherwise nothing.
Friends And Related Symbol Documentation
◆ CreateRoutingSegmentDefault
 Result< RoutingSegmentDefault > CreateRoutingSegmentDefault  |  ( |  Domain  |  domain | )
friend
Creates a RoutingSegmentDefault.
Parameters
domain | The Domain of the requested RoutingSegmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the RoutingSegment from the RoutingElement tool for the domain defined by the parameter, otherwise Error.